
<!-- terraform-plan-dev -->
### 🌍 Terraform Plan – **DEV**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.aws_eks_cluster.eks: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-009ca5ad29b63e822]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-0b8ebe68929ada6cd]
data.aws_eks_cluster.eks: Read complete after 1s [id=Shared-cluster]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0d9c9e6954886bf41]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00e85c19e906902aa]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-09e79c8263f2f9954]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01ff8cd4c75d64518]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b75675860f3183dc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06f4ad64daacdb30b]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-080a536f913ff1baa]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-08b0cc65543976499]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-0a454a484d49a38ba]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-097452adaf179926b]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-0dd58cccd1afd7805]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0ea29bf4ea0e55d9d]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0ab9f03c1d4fe30b6]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-05317d27cff29bf10]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-07628558736a84301]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-007ceb64091f5d8fd]
module.eks.aws_iam_role.node_role: Refreshing state... [id=dev-1-eks-node-role]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=dev-1-eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=dev-1-eks-cluster-role-20260317042007590600000006]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=dev-1-eks-node-role-20260317042007547500000004]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=dev-1-eks-node-role-20260317042007591500000007]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=dev-1-eks-node-role-20260317042007570400000005]
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-1499462687]
module.eks.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/88E4EFE5C61364CB7D846F4C2C7C0478]
module.addons.aws_eks_addon.coredns: Refreshing state... [id=Shared-cluster:coredns]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:dev-1-eks-node-group]
module.addons.aws_eks_addon.kube_proxy: Refreshing state... [id=Shared-cluster:kube-proxy]
module.addons.aws_eks_addon.vpc_cni: Refreshing state... [id=Shared-cluster:vpc-cni]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/88E4EFE5C61364CB7D846F4C2C7C0478"
    }

  # module.eks.aws_iam_openid_connect_provider.this will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "this" {
        id              = "arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/88E4EFE5C61364CB7D846F4C2C7C0478"
        tags            = {}
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks-access.aws_eks_access_entry.access["arn:aws:iam::358871393576:role/github-actions-terraform-role"] will be created
  + resource "aws_eks_access_entry" "access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "Shared-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::358871393576:role/github-actions-terraform-role"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks-access.aws_eks_access_policy_association.policy["arn:aws:iam::358871393576:role/github-actions-terraform-role"] will be created
  + resource "aws_eks_access_policy_association" "policy" {
      + associated_at = (known after apply)
      + cluster_name  = "Shared-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::358871393576:role/github-actions-terraform-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0ab9f03c1d4fe30b6"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0a454a484d49a38ba"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0a454a484d49a38ba"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-1-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + access_entries     = {
      + "arn:aws:iam::358871393576:role/github-actions-terraform-role" = {
          + access_entry_arn  = (known after apply)
          + cluster_name      = "Shared-cluster"
          + created_at        = (known after apply)
          + id                = (known after apply)
          + kubernetes_groups = (known after apply)
          + modified_at       = (known after apply)
          + principal_arn     = "arn:aws:iam::358871393576:role/github-actions-terraform-role"
          + tags              = null
          + tags_all          = (known after apply)
          + timeouts          = null
          + type              = "STANDARD"
          + user_name         = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
